In [2]:
import pyforest

In [3]:
people = {
    'first':['ashok','dattu','vinay','rohit',np.nan,None,'NA'],
    'last':['babu','naik','babu','guptha',np.nan,np.nan,'Missing'],
    'email':['gashokbabu999@gamil.com','gdattunaik@gmail.com','mvinaybabu@gmail.com',None,np.nan,'Anonymous@gmai.com','NA'],
    'age':[33,34,56,78,None,None,'Missing']
}

In [4]:
df = pd.DataFrame(people)

In [5]:
df

   first     last                    email      age
0  ashok     babu  gashokbabu999@gamil.com       33
1  dattu     naik     gdattunaik@gmail.com       34
2  vinay     babu     mvinaybabu@gmail.com       56
3  rohit   guptha                     None       78
4    NaN      NaN                      NaN     None
5   None      NaN       Anonymous@gmai.com     None
6     NA  Missing                       NA  Missing

In [6]:
!jt -t oceans16df

Didn't recognize theme name: oceans16df
Available Themes:
   chesterish
   grade3
   gruvboxd
   gruvboxl
   monokai
   oceans16
   onedork
   solarizedd
   solarizedl

In [7]:
df.dropna()

   first     last                    email      age
0  ashok     babu  gashokbabu999@gamil.com       33
1  dattu     naik     gdattunaik@gmail.com       34
2  vinay     babu     mvinaybabu@gmail.com       56
6     NA  Missing                       NA  Missing

In [8]:
df.dropna(axis='index',how='any')   #axis='index',how='any' is the default parameters of dropna
# if axis='columns' then it drop the entire column if it has any missin values

   first     last                    email      age
0  ashok     babu  gashokbabu999@gamil.com       33
1  dattu     naik     gdattunaik@gmail.com       34
2  vinay     babu     mvinaybabu@gmail.com       56
6     NA  Missing                       NA  Missing

In [9]:
# if how='all' then it only drops the row if all the values are missing in the row
df.dropna(axis='index',how='all')

   first     last                    email      age
0  ashok     babu  gashokbabu999@gamil.com       33
1  dattu     naik     gdattunaik@gmail.com       34
2  vinay     babu     mvinaybabu@gmail.com       56
3  rohit   guptha                     None       78
5   None      NaN       Anonymous@gmai.com     None
6     NA  Missing                       NA  Missing

In [12]:
df.dropna(axis='columns',how='all')

   first     last                    email      age
0  ashok     babu  gashokbabu999@gamil.com       33
1  dattu     naik     gdattunaik@gmail.com       34
2  vinay     babu     mvinaybabu@gmail.com       56
3  rohit   guptha                     None       78
4    NaN      NaN                      NaN     None
5   None      NaN       Anonymous@gmai.com     None
6     NA  Missing                       NA  Missing

In [13]:
df.dropna(axis='columns',how='any')

Empty DataFrame
Columns: []
Index: [0, 1, 2, 3, 4, 5, 6]

In [14]:
df.dropna(axis='index',how='any',subset=['age'])   #it drops the rows if age is missing in any row

   first     last                    email      age
0  ashok     babu  gashokbabu999@gamil.com       33
1  dattu     naik     gdattunaik@gmail.com       34
2  vinay     babu     mvinaybabu@gmail.com       56
3  rohit   guptha                     None       78
6     NA  Missing                       NA  Missing

In [15]:
df.dropna(axis='index',how='all',subset=['email','age'])  #if both email and age is missing it removes that row.that means it is ok if any of the field is filled

   first     last                    email      age
0  ashok     babu  gashokbabu999@gamil.com       33
1  dattu     naik     gdattunaik@gmail.com       34
2  vinay     babu     mvinaybabu@gmail.com       56
3  rohit   guptha                     None       78
5   None      NaN       Anonymous@gmai.com     None
6     NA  Missing                       NA  Missing

In [30]:
#replace the any value in the dataframe with your liked value by using replace method
df.replace('NA',np.nan,inplace=True)   #replace all NA values to nan value
#to apply the changes just use inplace=True

In [31]:
df.replace('Missing',np.nan,inplace=True)

In [32]:
df.isna()

   first   last  email    age
0  False  False  False  False
1  False  False  False  False
2  False  False  False  False
3  False  False   True  False
4   True   True   True   True
5   True   True  False   True
6   True   True   True   True

In [33]:
df.isna().sum()

first    3
last     3
email    3
age      3
dtype: int64

In [34]:
df.fillna('MISSING')  #all nan value with MISSING

     first     last                    email      age
0    ashok     babu  gashokbabu999@gamil.com       33
1    dattu     naik     gdattunaik@gmail.com       34
2    vinay     babu     mvinaybabu@gmail.com       56
3    rohit   guptha                  MISSING       78
4  MISSING  MISSING                  MISSING  MISSING
5  MISSING  MISSING       Anonymous@gmai.com  MISSING
6  MISSING  MISSING                  MISSING  MISSING

In [35]:
df.dtypes

first     object
last      object
email     object
age      float64
dtype: object

In [25]:
#if you have nan values in your data and if you want to apply any operation like mean convert them into float but not int becauses nan is a floating type value

In [36]:
df

   first    last                    email   age
0  ashok    babu  gashokbabu999@gamil.com  33.0
1  dattu    naik     gdattunaik@gmail.com  34.0
2  vinay    babu     mvinaybabu@gmail.com  56.0
3  rohit  guptha                     None  78.0
4    NaN     NaN                      NaN   NaN
5   None     NaN       Anonymous@gmai.com   NaN
6    NaN     NaN                      NaN   NaN

In [37]:
df['age'] = df['age'].astype(float)  #to cast the type of the datatypes we use astype method

In [38]:
df.dtypes

first     object
last      object
email     object
age      float64
dtype: object

In [39]:
df.age.mean()

50.25

In [40]:
#dataframe object also have astype method to convert all the dtypes to one type
df.astype(str)

   first    last                    email   age
0  ashok    babu  gashokbabu999@gamil.com  33.0
1  dattu    naik     gdattunaik@gmail.com  34.0
2  vinay    babu     mvinaybabu@gmail.com  56.0
3  rohit  guptha                      nan  78.0
4    nan     nan                      nan   nan
5    nan     nan       Anonymous@gmai.com   nan
6    nan     nan                      nan   nan

In [4]:
na_vals = ['NA','Missing']
df_public = pd.read_csv('datasets/survey_results_public.csv',index_col='Respondent',na_values=na_vals)   #if any value in the dataframe is in na_vals it convets it into np.nan 
df_schema = pd.read_csv('datasets/survey_results_schema.csv',index_col='Column')
df_public.head()

,MainBranch,Hobbyist,OpenSourcer,OpenSource,Employment,Country,Student,EdLevel,UndergradMajor,EduOther,...,WelcomeChange,SONewContent,Age,Gender,Trans,Sexuality,Ethnicity,Dependents,SurveyLength,SurveyEase
Respondent,,,,,,,,,,,,,,,,,,,,,
1,I am a student who is learning to code,Yes,Never,The quality of OSS and closed source software ...,"Not employed, and not looking for work",United Kingdom,No,Primary/elementary school,NaN,"Taught yourself a new language, framework, or ...",...,Just as welcome now as I felt last year,Tech articles written by other developers;Indu...,14.0,Man,No,Straight / Heterosexual,NaN,No,Appropriate in length,Neither easy nor difficult
2,I am a student who is learning to code,No,Less than once per year,The quality of OSS and closed source software ...,"Not employed, but looking for work",Bosnia and Herzegovina,"Yes, full-time","Secondary school (e.g. American high school, G...",NaN,Taken an online course in programming or softw...,...,Just as welcome now as I felt last year,Tech articles written by other developers;Indu...,19.0,Man,No,Straight / Heterosexual,NaN,No,Appropriate in length,Neither easy nor difficult
3,"I am not primarily a developer, but I write co...",Yes,Never,The quality of OSS and closed source software ...,Employed full-time,Thailand,No,"Bachelor’s degree (BA, BS, B.Eng., etc.)",Web development or web design,"Taught yourself a new language, framework, or ...",...,Just as welcome now as I felt last year,Tech meetups or events in your area;Courses on...,28.0,Man,No,Straight / Heterosexual,NaN,Yes,Appropriate in length,Neither easy nor difficult
4,I am a developer by profession,No,Never,The quality of OSS and closed source software ...,Employed full-time,United States,No,"Bachelor’s degree (BA, BS, B.Eng., etc.)","Computer science, computer engineering, or sof...",Taken an online course in programming or softw...,...,Just as welcome now as I felt last year,Tech articles written by other developers;Indu...,22.0,Man,No,Straight / Heterosexual,White or of European descent,No,Appropriate in length,Easy
5,I am a developer by profession,Yes,Once a month or more often,"OSS is, on average, of HIGHER quality than pro...",Employed full-time,Ukraine,No,"Bachelor’s degree (BA, BS, B.Eng., etc.)","Computer science, computer engineering, or sof...",Taken an online course in programming or softw...,...,Just as welcome now as I felt last year,Tech meetups or events in your area;Courses on...,30.0,Man,No,Straight / Heterosexual,White or of European descent;Multiracial,No,Appropriate in length,Easy

In [8]:
df_public['YearsCode'].isna().sum()

945

In [9]:
df_public['YearsCode'].mean()

TypeError: can only concatenate str (not "int") to str

In [12]:
df_public.dtypes.loc['YearsCode']

dtype('O')

In [13]:
df_public['YearsCode'].unique()

array(['4', nan, '3', '16', '13', '6', '8', '12', '2', '5', '17', '10',
       '14', '35', '7', 'Less than 1 year', '30', '9', '26', '40', '19',
       '15', '20', '28', '25', '1', '22', '11', '33', '50', '41', '18',
       '34', '24', '23', '42', '27', '21', '36', '32', '39', '38', '31',
       '37', 'More than 50 years', '29', '44', '45', '48', '46', '43',
       '47', '49'], dtype=object)

In [14]:
df_public['YearsCode'].replace('Less than 1 year',0,inplace=True)

In [15]:
df_public['YearsCode'].replace('More than 50 years',51,inplace=True)

In [17]:
df_public['YearsCode'] = df_public['YearsCode'].astype(float)

In [18]:
df_public['YearsCode'].mean()

11.662114216834588

In [19]:
df_public['YearsCode'].median()

9.0